# Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd

In [32]:
df = pd.read_csv('hacker_news.csv')

In [5]:
df.head()

,id,title,url,num_points,num_comments,author,created_at
0,12224879,Interactive Dynamic Video,http://www.interactivedynamicvideo.com/,386,52,ne0phyte,8/4/2016 11:52
1,11964716,Florida DJs May Face Felony for April Fools' W...,http://www.thewire.com/entertainment/2013/04/f...,2,1,vezycash,6/23/2016 22:20
2,11919867,Technology ventures: From Idea to Enterprise,https://www.amazon.com/Technology-Ventures-Ent...,3,1,hswarna,6/17/2016 0:01
3,10301696,Note by Note: The Making of Steinway L1037 (2007),http://www.nytimes.com/2007/11/07/movies/07ste...,8,2,walterbell,9/30/2015 4:12
4,10482257,Title II kills investment? Comcast and other I...,http://arstechnica.com/business/2015/10/comcas...,53,22,Deinos,10/31/2015 9:48

In [6]:
df.describe()

                 id    num_points  num_comments
count  2.009900e+04  20099.000000  20099.000000
mean   1.131755e+07     50.296632     24.803025
std    6.964531e+05    107.110322     56.108639
min    1.017691e+07      1.000000      1.000000
25%    1.070172e+07      3.000000      1.000000
50%    1.128452e+07      9.000000      3.000000
75%    1.192613e+07     54.000000     21.000000
max    1.257898e+07   2553.000000   1733.000000

In [9]:
df.columns

Index(['id', 'title', 'url', 'num_points', 'num_comments', 'author',
       'created_at'],
      dtype='object')

In [10]:
max(df['num_comments'])

1733

In [12]:
df.loc[0:2, ['num_points', 'num_comments']]

   num_points  num_comments
0         386            52
1           2             1
2           3             1

# Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [16]:
df = pd.DataFrame({'A':[1,2,3], 'B':[4,5,6], 'C':[7,8,9]})

In [17]:
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [25]:
new_index = pd.RangeIndex(start=1, step=2, stop=len(df)*2)
df.reset_index(drop=True).set_index(new_index)

   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

# Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should 
calculate and print the sum of the first three values, which is 60.

In [35]:
df = pd.DataFrame({'value':[10,20,30,40,50]})

In [38]:
def sum_of_3(df):
    sum = 0
    for index, row in df.iterrows():
        sum += row['value']
        if index == 2:
            break
    return sum

In [39]:
sum_of_3(df)

60

# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [52]:
df = pd.DataFrame({'text':['my name is akshay','hello world']})

In [55]:
def word_count(df):
    df['Word_count'] = df['text'].apply(lambda x: len(str(x).split()))
    return df

In [56]:
word_count(df)

                text  Word_count
0  my name is akshay           4
1        hello world           2

# Q5. How are DataFrame.size() and DataFrame.shape() different?

__DataFrame.size__ returns the total number of elements in the DataFrame. It represents the product of the number of rows and the number of columns in the DataFrame. It gives you the total count of elements, including missing or NaN (Not a Number) values.

__DataFrame.shape__ returns a tuple that represents the dimensions of the DataFrame. It provides the number of rows followed by the number of columns. It gives you the structure of the DataFrame in terms of its shape or size.

In [59]:
df.size

4

In [60]:
df.shape

(2, 2)

# Q6. Which function of pandas do we use to read an excel file?

In [62]:
df = pd.read_excel('Function.xlsx')

In [64]:
df.head()

,OrderDate,Region,Manager,SalesMan,Item,Units,Unit_price,Sale_amt
0,2018-01-06,East,Martha,Alexander,Television,95.0,1198.0,113810.0
1,2018-01-23,Central,Hermann,Shelli,Home Theater,50.0,500.0,25000.0
2,2018-02-09,Central,Hermann,Luis,Television,36.0,1198.0,43128.0
3,2018-02-26,Central,Timothy,David,Cell Phone,27.0,225.0,6075.0
4,2018-03-15,West,Timothy,Stephen,Television,56.0,1198.0,67088.0

# Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the 
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your 
function should extract the username from each email address and store it in the new 'Username' 
column.

In [65]:
df = pd.DataFrame({'email':['akshay@domain.com','jay@domain.com']})

In [66]:
df

               email
0  akshay@domain.com
1     jay@domain.com

In [74]:
def username(df):
    df['Username'] = df['email'].apply(lambda x : x.split('@')[0])
    return df

In [75]:
username(df)

               email Username
0  akshay@domain.com   akshay
1     jay@domain.com      jay

# Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [2]:
df = pd.DataFrame({'A':[1,3,5,7,9], 'B':[2,4,6,8,10], 'C':[11,12,13,14,15]})
df

   A   B   C
0  1   2  11
1  3   4  12
2  5   6  13
3  7   8  14
4  9  10  15

In [10]:
df2 = df[(df['A'] > 5) & (df['B'] < 10)]
def filter_data(df):
    df2 = df[(df['A'] > 5) & (df['B'] < 10)]
    return df2

In [11]:
filter_data(df)

   A  B   C
3  7  8  14

# Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [12]:
def calc_stat(df):
    values = df['values']
    mean = values.mean()
    median = values.median()
    std_dev = values.std()
    return mean,median,std_dev

In [19]:
df = pd.DataFrame({'values':[10,15,20,25,30]})
mean, median, std_dev = calc_stat(df)

In [20]:
print('Mean: ', mean)
print('Median: ',median)
print('Standard Deviation: ',std_dev)

Mean:  20.0
Median:  20.0
Standard Deviation:  7.905694150420948

# Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [25]:
def calc_moving_avg(df):
    window = 7
    df['MovingAverage'] = df['sales'].rolling(window = window, min_periods = 1).mean()
    return df

In [39]:
df = pd.DataFrame({'sales':[10,20,25,30,15,35,25,45,40,40], 'date':['2023-06-01', '2023-06-02', '2023-06-03', '2023-06-04', '2023-06-05',
                                                                     '2023-06-06', '2023-06-07', '2023-06-08', '2023-06-09', '2023-06-10']})

In [40]:
calc_moving_avg(df)

   sales        date  MovingAverage
0     10  2023-06-01      10.000000
1     20  2023-06-02      15.000000
2     25  2023-06-03      18.333333
3     30  2023-06-04      21.250000
4     15  2023-06-05      20.000000
5     35  2023-06-06      22.500000
6     25  2023-06-07      22.857143
7     45  2023-06-08      27.857143
8     40  2023-06-09      30.714286
9     40  2023-06-10      32.857143

# Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [53]:
def weekday(df):
    df['Weekday'] = df['date'].dt.strftime('%A')
    return df

In [54]:
df = pd.DataFrame({'date':['2023-06-27', '2023-06-28']})
df['date'] = pd.to_datetime(df['date'])

In [55]:
weekday(df)

        date    Weekday
0 2023-06-27    Tuesday
1 2023-06-28  Wednesday

# Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [70]:
df = pd.DataFrame({'date':['2023-01-10', '2023-01-01', '2023-02-03', '2023-02-04', '2023-02-15',
                           '2023-02-14', '2023-01-20', '2023-01-14', '2023-01-26', '2023-02-21'],
                   'sales':[10,20,30,40,50,60,70,80,90,10]})

In [71]:
df['date'] = pd.to_datetime(df['date'])

In [86]:
df2 = df[(df['date']>= '2023-01-01') & (df['date'] <= '2023-01-31')].sort_values('date')

In [87]:
df2

        date  sales
1 2023-01-01     20
0 2023-01-10     10
7 2023-01-14     80
6 2023-01-20     70
8 2023-01-26     90

# Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

The first and foremost necessary library that needs to be imported to use the basic functions of pandas is the __pandas library itself.__ The pandas library provides powerful __data manipulation and analysis__ capabilities through its __DataFrame and Series__ objects.

In [89]:
import pandas as pd